"""
Овен (21.03 – 20.04)
Телець (21.04 – 21.05)
Близнята (22.05 – 21.06)
Рак (22.06 – 22.07)
Лев (23.07 – 21.08)
Діва (22.08 – 23.09)
Терези (24.09 – 23.10)
Скорпіон (24.10 – 22.11)
Стрілець (23.11 – 21.12)
Козеріг (22.12 – 20.01)
Водолій (21.01 – 18.02)
Риби (19.02 – 20.03)
"""

from datetime import *
from calendar import *


day = int(input('Введите день вашего рождения:'))
month = int(input('Введите месяц вашего рождения:'))
max_day = monthrange(2023, month)[1]

if not (1 <= day <= max_day and 1 <= month <= 12):
    print('Ошибка, день или месяц неправильный!')
    exit()

user_date = date(2023, month, day)
if date(2023, 3, 21) <= user_date <= date(2023, 4, 20):
    print('Ти Овен')
    print('Представникам вогняних знаків — Овнам, Левам і Стрільцям — у 2023 році випаде щасливий білет. Ваші '
          'ініціативність, ентузіазм, лідерські якості матимуть великий попит, а ідеї надихатимуть інших на видатні '
          'досягнення. Цього року ви — допитливі мандрівники, що відкривають нові світи й тестують себе на якість '
          'взаємин з оточенням, на витривалість і вміння досягати мети.')
elif date(2023, 4, 21) <= user_date <= date(2023, 5, 21):
    print('Ти Телець')
    print('"Дайте мені точку опертя, і я зрушу світ!" — гасло представників знаків Землі на 2023 рік, який усіма '
          'способами спонукатиме послабити зайву обережність й опанувати продуктивну активність. Скрізь, '
          'де ви вкладатимете сили й час, є шанс отримати матеріальний результат і прокачати такі важливі для вас '
          'суперздібності, як терпіння, працьовитість, стійкість, надійність. Цього року представники знаків Телець, '
          'Діва, Козоріг — сміливі реалісти. Пом’якшити гостроту щоденних викликів можуть допомогти прості та '
          'зрозумілі речі, як-от хобі. Одне з них — гончарство, традиційне для українців ремесло, яке не тільки '
          'демонструє глибокий зв’язок між минулим і сьогоденням, а й сприяє віднайденню душевного спокою та '
          'фокусуванню на важливому тут і зараз.')
elif date(2023, 5, 22) <= user_date <= date(2023, 6, 21):
    print('Близнята')
    print('Близнецы готовы встретиться лицом к лицу со всеми нерешенными проблемами, достичь успеха, совершить '
          'рискованные и решительные действия в 2022 году. Пора «вернуться на землю», настроиться на успех и быть '
          '«здесь и сейчас».')
elif date(2023, 6, 22) <= user_date <= date(2023, 7, 22):
    print('Рак')
    print('Карьерный гороскоп на 2023 год для знака Рак. На работе, возможно, появятся более сложные обязанности. '
          'Если это только начало вашей карьеры, то также ожидается трудный период. Ракам помогут произвести '
          'впечатление искренность и действия, с середины 2022 года – время карьерного роста и успеха.')
elif date(2023, 7, 23) <= user_date <= date(2023, 8, 21):
    print('Лев ')
    print('Что ждет Льва в 2023 году? Его ждет обновление, расставание с прошлым, время перемен во всех сферах жизни '
          'и стремительного движения вперед, навстречу счастью и успеху. В новом году Львы обязаны укрепить '
          'авторитет, отказаться от общения с ненадежными бизнес-партнерами и решить проблемы в личных отношениях.')
elif date(2023, 8, 22) <= user_date <= date(2023, 9, 23):
    print('Діва')
    print('В 2023 году Кролик обещает Девам осуществить их заветную мечту. Астрологи рекомендуют сосредоточиться '
          'представителям знака на финансовом и амурном аспектах своей жизни, поскольку в новом году они будут тесно '
          'сплетены. Прогнозируется, что именно вторая половинка поможет Девам достичь благосостояния.')
elif date(2023, 9, 24) <= user_date <= date(2023, 10, 23):
    print('Терези ')
    print('Гороскоп на 2023 год для знака Весы говорит, что новый год принесет положительные результаты. Появится '
          'время заняться увлечениями. Кроме того, финансовых возможностей будет достаточно: доход, повышение '
          'зарплаты, рост вашей значимости. Но вы должны уметь оптимизировать свой рабочий процесс, чтобы стать более '
          'успешным.')
elif date(2023, 10, 24) <= user_date <= date(2023, 11, 22):
    print('Скорпіон')
    print('Астрологи советуют вам оставить прошлое позади, начать все заново и стараться мыслить '
          'нестандартно.Некоторым предполагается повышение заработка. Новые бизнес-проекты имеют хорошие шансы на '
          'успех в 2023 году, а инвестиции также принесут прибыль.Вы можете заметить, что вас увлекают романтические '
          'мысли и хочется больше общения в первые несколько месяцев.В первые два квартала года следует уделить '
          'повышенное внимание своему здоровью и не давать стрессу власть над собой.')
elif date(2023, 11, 23) <= user_date <= date(2023, 12, 21):
    print('Стрілець')
    print('2023-й – по восточному календарю, год Черного Водяного Кролика. Такое соотношение цвета, животного и '
          'стихии происходит раз в 60 лет. То есть в прошлом Черный Водяной Кролик приходил к людям еще в 1963 году. '
          'Его особенность – в творческой натуре. Конечно, во многом то, будет ли год успешным или нет, зависит от '
          'самих людей. Но также нужно обратить внимание, насколько комфортна будет «вода» вокруг вас.')
elif date(2023, 12, 22) <= user_date <= date(2023, 1, 20):
    print('Козеріг')
    print('"Дайте мені точку опертя, і я зрушу світ!" — гасло представників знаків Землі на 2023 рік, який усіма '
          'способами спонукатиме послабити зайву обережність й опанувати продуктивну активність. Скрізь, '
          'де ви вкладатимете сили й час, є шанс отримати матеріальний результат і прокачати такі важливі для вас '
          'суперздібності, як терпіння, працьовитість, стійкість, надійність. Цього року представники знаків Телець, '
          'Діва, Козоріг — сміливі реалісти.Пом’якшити гостроту щоденних викликів можуть допомогти прості та '
          'зрозумілі речі, як-от хобі. Одне з них — гончарство, традиційне для українців ремесло, яке не тільки '
          'демонструє глибокий зв’язок між минулим і сьогоденням, а й сприяє віднайденню душевного спокою та '
          'фокусуванню на важливому тут і зараз.')
elif date(2023, 1, 21) <= user_date <= date(2023, 2, 18):
    print('Водолій ')
    print('На представників знаків повітряної стихії — Близнят, '
          'Терезів і Водолія — чекає динамічний рік, який сприятиме проявам ініціативи в комунікації й '
          'інтелектуальній діяльності. Рушійними силами 2023-го стануть ваше натхнення, легкість і життєлюбність. А '
          'експертність, здатність до компромісів і підтримка надійних партнерів допоможуть досягти задуманого. Цього '
          'року ви — активні стратеги.Пом’якшити гостроту щоденних викликів можуть допомогти прості та зрозумілі '
          'речі, як-от хобі. Одне з них — випікання, традиційне для українців ремесло, яке не тільки демонструє '
          'глибокий зв’язок між минулим і сьогоденням, а й сприяє віднайденню душевного спокою та фокусуванню на '
          'важливому тут і зараз.')
elif date(2023, 2, 19) <= user_date <= date(2023, 3, 20):
    print('Риби ')
    print('')
